// ==========================================
// Цикли (Loops) - цикл for
// ==========================================
for (let i = 1; i <= 5; i++) {
  // пам'ятати: i = 1 це старт, i <= 5 умова поки працює, i++ додає по одному
  console.log(i);
}

for (let i = 5; i >= 1; i--) {
  // зворотній відлік: починаю з 5, поки не дійде до 1, i-- віднімає по одному
  console.log(i);
}

// =============================================================

let clients = ["Mike", "Fred", "Li"];

for (let i = 0; i < clients.length; i++) {
  // перебираю масив: починаю з 0 бо індекси завжди з нуля, і кручу до кінця списку через length
  console.log(`Вітаємо ${clients[i]}`);
}

// =============================================================

let shoppingCart = ["Laptop", "Maus", "Keyboard"];
for (let item of shoppingCart) {
  // лінивий цикл for...of: просто бере кожен елемент по черзі і кидає в item
  console.log(`Товар у кошику ${item}`);
}
console.log("-------------------------------------");
